[
    "This hammer belongs to Thor, who is a member of an alien race called the Asgardians. He is inspired by the northern God of Thunder, is super strong, and his hammer can throw lightning and make him fly. He is basically a god. But his father Odin is not OK with Thor becoming king just yet because he is cocky. So he banishes him to Earth and strips him of his powers (including the power of lifting the Hammer). While Thor is away, his evil brother Loki plots to take over Asgard. After some adventures, Loki is beaten and Thor has his powers back, because he is worthy of them",
    "During that time, a scientist, specialized in gamma radiation, is employed by the army. They want to reproduce an old program that created a super human. It does not go as planned. He experiments on himself but the formula is not complete. The result of the experiment is that the scientist, Bruce Banner, becomes terrible at anger management. If his heart accelerates too much, Bruce becomes the Hulk, a 3 meters rage monster (think Green Giant on steroids). After some problems, he exiles himself somewhere and tries to control his anger issues.",
    "Meanwhile, Tony Stark is doing great. He revealed that he was Iron Man to the whole world and works for the military to enforce peace. He is pretty good at that but he stopped making weapon after his kidnapping so he does not want to build more armors for the military. A rival manufacturer wants to compete so he gets a russian engineer with a grudge against Tony to build an army of drones. Of course, Tony saves the day with the help of his best friend (Rhodey) in a modified armor called War Machine, a former russian super spy who is now an american super spy in SHIELD (Black Widow) and Nick Fury. At the end of this last movie, we learn that an unliftable hammer has landed in New Mexico. Coulson, the super agent of SHIELD goes there to retrieve it.",
    "The terrorist want him to build a superweapon but with help from another kidnapped scientist, he fools them, building an armor and a small reactor/magnet he puts in his chest to repel the schrapnels/power the armor. He then escapes, returns home, upgrades his reactor and his armor and becomes the Iron Man, a super hero with a badass armor. After some fights with his evil partner in his firm, he is contacted by Nick Fury, the director of SHIELD (a super secret spying agency) who is interested in something called the Avengers initiative. We encounter a guy called Coulson, who is an agent of SHIELD."
]
